In [ ]:
QUESTION -1

In [ ]:
def c(a):
    return a+2

In [ ]:
a=0
def b():
    global a
    a=c(a)



In the given module:

*a is initially set to 0.

*You call the function b() the first time:

Inside b(), you use the global keyword to declare a as a global variable.
c is called with the global variable a, which is 0.
c adds 2 to 0 and returns 2.
The returned value (2) is assigned back to the global variable a. So, now a is 2.
You call the function b() the second time:

* you use the global keyword within b().
c is called with the global variable a, which is now 2.
c adds 2 to 2 and returns 4.
The returned value (4) is assigned back to the global variable a. So, now a is 4.
*You call the function b() the third time:

Once more, you use the global keyword within b().
c is called with the global variable a, which is now 4.
c adds 2 to 4 and returns 6.

The returned value (6) is assigned back to the global variable a. So, now a is 6.
When you evaluate the expression a at the end, it will display the current value of a, which is 6.

In [ ]:
QUESTION-2

In [3]:
def fileLength(filename):
    try:
        infile = open(filename, 'r')
        contents = infile.read()
        infile.close()
        length = len(contents)
        print(f"File {filename} has {length} characters.")
    except FileNotFoundError:
        print(f"File {filename} not found.")


fileLength(r"C:\Users\ravee\Downloads\receipt-BDAT1002-23F-10976-Midterm.txt")
fileLength("ravee.py")

File C:\Users\ravee\Downloads\receipt-BDAT1002-23F-10976-Midterm.txt has 228 characters.
File ravee.py not found.

In [ ]:
QUESTION-3

In [4]:
class Marsupial: 
    def __init__(self):
        self.pouch = []
    
    def pouch_contents(self):
        return self.pouch
    
    def put_in_pouch(self, item):
        self.pouch.append(item)
        
class Kangaroo(Marsupial):
    def __init__(self, x=0, y=0):
        super().__init__()
        self.x = x
        self.y = y

    def jump(self, dx, dy):
        self.x += dx
        self.y += dy

    def __str__(self):
        return f"I am a Kangaroo located at coordinates ({self.x},{self.y})"

    
m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()
print(m.pouch_contents())

['doll', 'firetruck', 'kitten']

In [5]:
k = Kangaroo(0,0)
print(k)
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

In [ ]:
QUESTION-4

In [6]:
def collatz(x):
    sequence = [x]
    while x != 1:
        if x % 2 == 0:
            x = x // 2
        else:
            x = 3 * x + 1
        sequence.append(x)
    return sequence

# Call the function and print the result
print('Collatz sequence for 1:', collatz(1))
print('Collatz sequence for 10:', collatz(10))

Collatz sequence for 1: [1]
Collatz sequence for 10: [10, 5, 16, 8, 4, 2, 1]

In [ ]:
QUESTION-5

In [9]:
def binary(n):
    if n < 0:
        return "Enter a non-negative number"
    elif n == 0:
        return "0"
    else:
        return binary(n // 2) + str(n % 2)

binary_representation = binary(10)
print(binary_representation)

01010

In [21]:
binary(9)

'01001'

In [22]:
binary(6)

'0110'

In [ ]:
QUESTION-8

In [10]:
import pandas as pd
import sqlite3

# Creating sqlite3 database
conn = sqlite3.connect('Weatherdata.db')

# Creating table 
conn.execute('''CREATE TABLE seasons_data
            (City TEXT, Country TEXT, Season TEXT, Temperature FLOAT, Rainfall FLOAT)''')

# Inserting data into the seasons_data table
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Winter', 24.8, 5.9)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Spring', 28.4, 16.2)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Summer', 27.9, 1549.4)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Fall', 27.6, 346.0)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('London' , 'United Kingdom' , 'Winter' , 4.2,207.7)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('London' , 'United Kingdom' , 'Spring' , 8.3,169.6)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('London' , 'United Kingdom' , 'Summer' , 15.7,157.0)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('London' , 'United Kingdom' , 'Fall' , 10.4,218.5)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Cairo', 'Egypt', 'Winter' , 13.6, 16.5)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Cairo', 'Egypt', 'Spring' , 20.7, 6.5)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Cairo', 'Egypt', 'Summer' , 27.7, 0.1)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Cairo', 'Egypt', 'Fall' , 22.2, 4.5)")

In [14]:
a = pd.DataFrame(conn.execute("SELECT Temperature FROM seasons_data"))

a.columns = ['Temperature']
a

    Temperature
0          24.8
1          28.4
2          27.9
3          27.6
4           4.2
5           8.3
6          15.7
7          10.4
8          13.6
9          20.7
10         27.7
11         22.2

In [12]:
b = pd.DataFrame(conn.execute("SELECT DISTINCT City FROM seasons_data"))

b.columns = ['City']
b

     City
0  Mumbai
1  London
2   Cairo

In [13]:
c = pd.DataFrame(conn.execute("SELECT * FROM seasons_data WHERE Country='India'"))

c.columns = ['City', 'Country', 'Season', 'Temperature', 'Rainfall']
c

     City Country  Season  Temperature  Rainfall
0  Mumbai   India  Winter         24.8       5.9
1  Mumbai   India  Spring         28.4      16.2
2  Mumbai   India  Summer         27.9    1549.4
3  Mumbai   India    Fall         27.6     346.0

In [15]:
d = pd.DataFrame(conn.execute("SELECT * FROM seasons_data WHERE Season='Fall'"))

d.columns = ['City', 'Country', 'Season', 'Temperature', 'Rainfall']
d

     City         Country Season  Temperature  Rainfall
0  Mumbai           India   Fall         27.6     346.0
1  London  United Kingdom   Fall         10.4     218.5
2   Cairo           Egypt   Fall         22.2       4.5

In [16]:
e = pd.DataFrame(conn.execute("""
    SELECT City, Country, Season
    FROM seasons_data
    GROUP BY City, Country, Season
    HAVING AVG(Rainfall) BETWEEN 200 AND 400
"""))

e.columns = ['City', 'Country', 'Season']
e

     City         Country  Season
0  London  United Kingdom    Fall
1  London  United Kingdom  Winter
2  Mumbai           India    Fall

In [17]:
f = pd.DataFrame(conn.execute("""
    SELECT City, Country
    FROM seasons_data
    WHERE Season='Fall'
    GROUP BY City, Country
    HAVING AVG(Temperature) > 20
    ORDER BY AVG(Temperature)
"""))

f.columns = ['City', 'Country']
f

     City Country
0   Cairo   Egypt
1  Mumbai   India

In [18]:
g = pd.DataFrame(conn.execute("""
    SELECT SUM(Rainfall) AS total_annual_rainfall
    FROM seasons_data
    WHERE City='Cairo'
"""))

g = g.rename(columns={0: 'Total Annual Rainfall'})
g

   Total Annual Rainfall
0                   27.6

In [19]:
h = pd.DataFrame(conn.execute("""
    SELECT Season, SUM(Rainfall) AS total_rainfall
    FROM seasons_data
    GROUP BY Season
"""))
h = h.rename(columns={0: 'Season', 1: 'Total Rainfall'})
h

   Season  Total Rainfall
0    Fall           569.0
1  Spring           192.3
2  Summer          1706.5
3  Winter           230.1

In [20]:
conn.commit()
conn.close()

In [ ]:
QUESTION-9

In [8]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

# Part a: Uppercase the words
w_up = [word.upper() for word in words]
print('a> Uppercase:', w_up)

# Part b: Lowercase the words
w_lo = [word.lower() for word in words]
print('b> Lowercase:', w_lo)

# Part c: Calculate the lengths of the words
w_len = [len(word) for word in words]
print('c> Word Lengths:', w_len)

# Part d: Create a list of uppercase, lowercase, and lengths for each word
w_ull = [[word.upper(), word.lower(), len(word)] for word in words]
print('d> Uppercase, Lowercase, Length:', w_ull)

# Part e: Filter words with a length greater than 3 characters
w_long = [word for word in words if len(word) > 3]
print('e> Words with Length > 3:', w_long)

a> Uppercase: ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
b> Lowercase: ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
c> Word Lengths: [3, 5, 5, 3, 5, 4, 3, 4, 3]
d> Uppercase, Lowercase, Length: [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]
e> Words with Length > 3: ['quick', 'brown', 'jumps', 'over', 'lazy']